Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་གདུང་བྲལ་མངོན་པར་འཕགས་པ་རྣམ་ཐོས་ཀྱི་བུ་སཱ་ལའི་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་བོས་ཏེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཅག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་དེང་ལ་ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་སྙུན་མི་མངའ་འམ།
en: The Tathāgata Vigatasaṃtāpobhavavaiśravaṇasālarāja said to the two bodhisattvas, “Noble sons, go to the Sahā realm with these words of mine and ask the tathāgata Śākyamuni about his health: ‘Are you well?

source: བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་སྙུན་གསོལ་ཅིག །དེ་གཉིས་ཀྱིས་གསོལ་པ།
en: Are you comfortable?’ ”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱིས་དང་ནམ་མཁའ་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མཐོང་སྟེ།
en: The two bodhisattvas said, “Bhadanta Bhagavat, we have seen that in the entire Sahā buddha realm the ground and the sky are filled with beings.

source: དེ་ནས་དང་ནམ་མཁའ་ལ་སེམས་ཅན་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མ་མཆིས་ན། བདག་ཅག་གང་དུ་གནས་པར་བགྱི་ལགས།
en: There is no room, either on the ground or in the sky, for even a few beings, so where would we sit?” “

source: དེ་བཞིན་གཤེགས་པ་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་གོ་སྐབས་མེད་དོ་ཞེས་དེ་སྐད་མ་ཟེར་ཅིག །
en: Noble sons,” replied the Tathāgata, “don’t say that there is no room in the Sahā buddha realm.

source: རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དག་གིས་གོ་སྐབས་ཡངས་པ་ཡིན་ཏེ།
en: Because, noble sons, the Tathāgata Śākyamuni provides a vast amount of room through the inconceivable qualities of buddhahood.

source: སྔོན་གྱི་སྨོན་ལམ་གྱིས་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། ཐེག་པ་གསུམ་གྱི་ཆོས་བསྟན་པ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་པར་མཛད་པ་དང་།
en: Through his previous prayers, he teaches the Dharma, beginning with refuge in the Three Jewels and the teaching of the three yānas.

source: ཞི་བའི་ལམ་གསུམ་པོ་དག་ལ་རབ་ཏུ་འགོད་པར་མཛད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེའི་ཐུགས་རྗེ་དང་བསྟན་པ་ལ་འཇུག་པ་ནི་ཡངས་པ་ཡིན་ནོ།
en: Therefore, the Tathāgata’s compassion and the entry into his teaching are vast. “

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་པའི་དུས་ཤིག་ན། འདུལ་བའི་སེམས་ཅན་ལ་གཟིགས་ཤིང་རི་བྲག་མི་མཉམ་པའི་དབུས་ན་གནོད་སྦྱིན་དབང་པོའི་མིག་ཅེས་བྱ་བའི་གནས་སཱ་ལའི་ཕུག་ན་རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་།
en: Noble sons, at one time, not long after the Tathāgata Śākyamuni attained complete buddhahood, while observing which beings were to be guided, he stayed in the hollow of a Sal tree that was the home of a yakṣa named Indrākṣa, in the middle of a rugged, rocky mountain.

source: བདེ་བ་ཉམས་སུ་མྱོང་ཞིང་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཞག་བདུན་འདའ་བར་མཛད་ཅིང་བཞུགས་པ་ན།
en: For seven days he remained cross-legged, experiencing the joy and bliss of liberation.

source: དེ་བཞིན་གཤེགས་པའི་སྐུས་སཱ་ལའི་ཕུག་ཐམས་ཅད་ཁྱབ་པར་གྱུར་ཏེ། དེ་ན་གང་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུས་ཁྱབ་པར་མ་གྱུར་པའི་གོ་སྐབས་ནི་ཐ་ན་སོར་བཞི་ཙམ་གྱི་གཏོས་ཀྱང་མེད་དོ།
en: The Tathāgata’s body filled the tree hollow; there wasn’t even a four-finger-width space that was not filled by the Tathāgata’s body. “

source: །ཞག་བདུན་པོ་དེ་འདས་པ་དང་། ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཕྱག་བྱ་བ་དང་།
en: When seven days had passed, twelve hundred million bodhisattva mahāsattvas came from the ten directions to the Sahā realm and sat on the side of the mountain in order to pay homage to the Tathāgata Śākyamuni, attend upon him, and listen to his Dharma teaching.”

source: བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་རི་དེ་གང་ཡིན་པ་དེ་ལོགས་སུ་མངོན་དུ་ཕྱོགས་ཏེ་འཁོད་པ་དང་ཞེས་བྱ་བ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཇི་སྐད་སྨོས་པའི་ཆོས་བཞི་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་གཞན་དག་ལས་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་དུ་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་ཏེ།
en: He continued, as previously described, up until: “Due to these four qualities that have been described, the Tathāgata Śākyamuni is superior to all other tathāgatas.” “

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ལོང་ལ། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་ལོགས་སུ་རང་རང་གིས་ཇི་ལྟར་མཐོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་དེང་ཤིག །
en: Noble sons, take these flowers, which have the stainless beauty of the color of the moon, and go to the Sahā buddha realm, which I can see in the southwest.

source: ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་སྙུན་མི་མངའ་འམ།
en: There inquire after his health by repeating these words of mine to the Tathāgata Śākyamuni: ‘Are you well?

source: ཐུགས་བདེའམ་ཞེས་ཀྱང་སྙུན་གསོལ་ཅིག །
en: Are you at ease?’ ”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་གདུང་བྲལ་མངོན་པར་འཕགས་པ་རྣམ་ཐོས་ཀྱི་བུ་སཱ་ལའི་རྒྱལ་པོ་དེས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་བླངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་འཁྲུགས་མེད་རྩེ་མོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཡང་དག་འདོད་ལ་བྱིན་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ངའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པས་ཁྱེད་ཅག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེང་ཤིག །
en: Then the Tathāgata Vigatasaṃtāpodbhavavaiśravaṇasālarāja picked up the flowers that had the stainless beauty of the color of the moon, gave them to the bodhisattva Vigopaśikhara and the bodhisattva Saṃrocanabuddha, and said to them, “Noble sons, go to the Sahā realm through my miraculous power.”

source: དེ་ན་སྲོག་ཆགས་ཉི་ཁྲིས་ཀྱང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་མཐུས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བའི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་མཆིས་ལགས་སོ།
en: Twenty thousand beings then said, “Bhadanta Bhagavat, we also, through the power of the Tathāgata, will go to the Sahā realm in order to see, pay homage to, and attend upon the Tathāgata Śākyamuni.” “

source: །དེ་བཞིན་གཤེགས་པ་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེང་ཤིག །
en: Noble sons, go as you wish to,” replied the Tathāgata.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་དང་ལྷན་ཅིག་འགྲོགས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་རྒྱལ་བ་དེ་ནས་འཕགས་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ཕྱིན་ཏེ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་སོ་སོར་འཁོད་དོ།
en: Then, through the miraculous power of that tathāgata, those two bodhisattvas together with twenty thousand other bodhisattvas rose from the realm Vijaya and in one instant of the mind arrived in this Sahā buddha realm and were upon Vulture Peak Mountain.

source: །འཁོད་ནས་ཀྱང་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ནས་བྱང་ཤར་གྱི་ཕྱོགས་ལོགས་སུ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་གཤེགས་པ་དེས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ཀྱང་བསྐུར་ཞིང་། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ།
en: They placed their palms together and, facing the bhagavat, the Tathāgata Śākyamuni, they said, “Bhadanta Bhagavat, in the northeastern direction from this buddha realm…,” and so on, as previously described, up to and including giving him the flowers that had the stainless beauty of the color of the moon, and they inquired after his health, asking, “Are you well?

source: ཐུགས་བདེའམ་ཞེས་ཀྱང་སྙུན་གསོལ་ལགས་སོ་བཞེས་བྱ་བའི་བར་དུ་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་དུ་སྦྱར་རོ།
en: Are you at ease?”

source: །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་གནས་རྣམ་པར་འཇོམས་པའི་གདན་ཡང་གཡོས་ཏེ།
en: The seat of the Tathāgata Mārabhavanavidhvaṃsana shook.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་དེར་འདུས་པར་གྱུར་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་བདུད་ཀྱི་གནས་རྣམ་པར་འཇོམས་པའི་གདན་ཡང་གཡོས་པ་མཐོང་སྟེ།
en: The bodhisattvas who were assembled there saw the Tathāgata Mārabhavanavidhvaṃsana’s seat shake.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡོངས་སུ་ཞུས་པ་ནས་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དག་བཞིན་ནོ། །དེ་བཞིན་དུ་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དང་། རྣམ་པར་གནོན་པ་ཆེན་པོའི་འོད་ཟེར་དང་། པད་མ་དམ་པ་དང་། ཙན་དན་དང་། ལྷུན་པོའི་རྒྱལ་པོ་དང་། རྒྱ་མཚོ་དང་། སྐར་མའི་སྙིང་པོ་དང་། རྣམ་པར་གནོན་པའི་ཡེ་ཤེས་དང་།
en: They asked the Tathāgata about it, and so on, as previously described.

source: བྱང་ཤར་གྱི་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པའི་བར་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཡོངས་སུ་ཞུ་བ་དང་། མཆོད་པ་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་ཐོགས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ལྷགས་པ་དང་།
en: At that time, similarly, the tathāgatas Sālendrarāja, Vikramaraśmi, Padmottara, Candana, Merurāja, Sāgara, Sārajyoti, and Jñānavikrama, and countless, innumerable bhagavat buddhas in the northeastern direction, sent bodhisattvas, carrying flowers that had the stainless beauty of the color of the moon, to inquire after the health of the Tathāgata Śākyamuni, make offerings to him, pay homage to him, serve him, and listen to his Dharma teaching, and they arrived in this Sahā buddha realm.

source: དེའི་མོད་ལ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་འདུས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རེ་རེའི་ལུས་ཀྱང་དཔག་ཚད་ཀྱི་ཚད་ཙམ་དུ་གྱུར་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དེ་ལྟ་བུའི་སེམས་ཅན་དག་གིས་ཀྱང་ཁྱབ་པར་གྱུར་ཏོ།
en: At that moment, the Tathāgata Śākyamuni, through his miraculous power, transformed the bodies of every being who had gathered in the Sahā buddha realm to become a yojana in height, and the entire Sahā buddha realm became filled with such beings.

source: །སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་ས་དང་ནམ་མཁའ་ཐམས་ཅད་སེམས་ཅན་དེ་དག་གིས་ཁྱབ་པར་གྱུར་ཏེ།
en: Those beings filled all the ground and sky in this buddha realm.

source: གང་དུ་སེམས་ཅན་དག་གིས་ཁྱབ་པར་མ་གྱུར་པའི་གོ་སྐབས་ནི་ཐ་ན་མིག་སྨན་གྱི་ཐར་མ་གཟུགས་པའི་གཏོས་ཙམ་ཡང་མེད་དོ།
en: There wasn’t even a space the size of a collyrium stick that had not been filled by these beings.

source: །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་མཐོང་བ་མ་གཏོགས་པར་ནམ་མཁའ་སྟོང་པ་མཐོང་དུ་ཟད་ཀྱི་གཅིག་གིས་གཅིག་ནི་མ་མཐོང་ངོ་།
en: All those beings could only see the Tathāgata Śākyamuni. They could not see any empty space left and could not even see each other.

source: །དེ་དག་མིག་གི་ལམ་དུ་རི་རབ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དང་། རི་རྣམས་ཀྱང་སྣང་བར་མ་གྱུར་ཏོ།
en: Their eyes did not perceive Mount Sumeru, Cakravāḍa, Mahācakravāḍa, or other mountains.

source: །འཇིག་རྟེན་གྱི་བར་དག་ཀྱང་མི་སྣང་། ལྷའི་གཞལ་མེད་ཁང་རྣམས་ཀྱང་མི་སྣང་སྟེ། འོག་ཏུ་གསེར་གྱི་འཁོར་ལོ་ལ་ཐུག་པའི་བར་དང་། དེའི་སྟེང་གི་ས་གཞི་ཡང་མིག་ལམ་དུ་སྣང་བར་མ་གྱུར་ཏོ།
en: They did not perceive the in-between worlds, did not perceive the palaces of deities, and did not perceive the disk of gold below or the earth above it.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་མཁའ་ཁྱབ་ཆོས་སེལ་ཤིན་ཏུ་སྦྱངས་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་པ་དང་།
en: The Bhagavat then entered the confidence in the elimination of phenomena samādhi, which pervades space.

source: དེས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྤུའི་སྒོ་ཐམས་ཅད་དུ་ཞུགས་ཏེ།
en: Through that samādhi, all the flowers that had the stainless beauty of the color of the moon entered the Bhagavat’s pores.

source: གང་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་ཁོངས་སུ་ཆུད་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་མཐོང་ངོ་།
en: All the beings who were in the Sahā realm saw this.

source: །སེམས་ཅན་དེ་དག་གི་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་ཀྱང་གཟུགས་ལ་ཀུན་དུ་ལྟ་བའི་ཡིད་ལ་བྱེད་པ་དང་བྲལ་ཞིང་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྤུའི་སྒོ་འབའ་ཞིག་ཏུ་ངེས་པར་རྟོགས་ཏེ། དེར་ཡང་འདི་ལྟ་སྟེ་དཔེར་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་སྐྱེད་མོས་ཚལ་ལྟ་བུར་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་དང་། ལོ་མ་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་།
en: Their minds and mental events became devoid of the mental engagement that sees forms, and all they perceived were the pores of the Bhagavat.

source: འབྲས་བུ་སྣ་ཚོགས་ཀྱིས་གང་བའི་སྐྱེད་མོས་ཚལ་དག་མཐོང་ངོ་། །ཤིང་ལྗོན་པ་རས་བཅོས་བུ་སྣ་ཚོགས་དང་། གོས་སྣ་ཚོགས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། དཔུང་རྒྱན་དང་། མུ་ཏིག་གི་ཆུན་པོ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་དེ་དག་མཐོང་བ་དང་།
en: There they saw parks, like the parks in the realm of Sukhāvatī, which were filled with all kinds of precious trees, and they saw trees adorned by all kinds of leaves, flowers, fruits, cloths, clothing, parasols, victory banners, flags, armlets, and strings of pearls.

source: སེམས་ཅན་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་སྐྱེད་མོས་ཚལ་དེ་ལྟར་འདོད་དོ་སྙམ་ནས།
en: Those beings thought, “We want to go into that park to see it.”

source: གང་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་ཁོངས་སུ་ཆུད་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ལས་སེམས་ཅན་དམྱལ་བ་པ་རྣམས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་རྣམས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་རྣམས་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པ་རྣམས་མ་གཏོགས་པར་སེམས་ཅན་ལྷག་མ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དེའི་སྤུའི་སྒོ་དག་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནང་དུ་ཞུགས་པར་གྱུར་ཏོ།
en: All the beings in the Sahā realm, apart from those in the hells, those in Yama’s realm, the animals, and those in the formless realm, entered into the Tathāgata’s body through his pores.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་དེ་དག་སླར་བསྡུས་ཏེ་བཞེངས་པ་དང་། དེ་ནས་སེམས་ཅན་དེ་དག་གཅིག་གིས་གཅིག་མཐོང་ནས་སྨྲས་པ།
en: The Bhagavat then concluded his miracle and came out from his meditation, and the beings could again see each other.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བཞུགས།
en: They wondered, “Where is the Tathāgata Śākyamuni?”

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་སྨྲས་པ། ཀྱེ་སེམས་ཅན་དག་བདག་ཅག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁོང་པར་ཞུགས་པར་ཤེས་བཞིན་གྱིས་སོམས་ཤིག །
en: The bodhisattva Maitreya said, “O beings, discern carefully that we have all entered the body of the Tathāgata!”

source: དེ་ནས་སེམས་ཅན་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཕྱི་ནང་བཅས་པར་མཐོང་ཞིང་ཇི་ལྟར་བདག་ཅག་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁོང་པར་ཞུགས་ཏེ་འདུས་པར་གྱུར་པ་རང་རང་གི་མངོན་སུམ་དུ་གྱུར་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Each of those beings then directly perceived the inside and outside of the Tathāgata’s body. They wondered, “How did we enter and assemble inside the Tathāgata’s body?

source: བདག་ཅག་གང་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁོང་པར་ཞུགས་ཤིང་སུས་འདིར་བཅུག་སྙམ་མོ།
en: Through where did we enter the Tathāgata’s body? Who made us enter?”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་རྣམས་ལ་སྒྲས་མངོན་པར་གོ་བར་བྱས་ཏེ་སྨྲས་པ། ཁྱེད་ཅག་ཉོན་ཅིག །
en: The bodhisattva Maitreya then proclaimed to the entire assembly, “Listen!

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་ཡིན་ཏེ།
en: This is a miraculous transformation performed by the Tathāgata.

source: གང་གི་ཕྱིར་བདག་ཅག་ལ་ཕན་པར་མཛད་པའི་སྟོན་པས་ཆོས་སྟོན་པར་མཛད་ཀྱིས་དེའི་ཕྱིར་ཁྱེད་ཅག་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སོམས་ཤིག །
en: He is the teacher who will teach us the Dharma in order to benefit us, and so we should give him all our attention.”

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་རྣམས་ཀྱིས་ཐལ་མོ་སྦྱར་བ་བཏུད་པ་དང་།
en: Then the entire assembly placed their palms together and bowed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདེ་བ་སྤྱོད་པའི་ཆོས་ཐམས་ཅད་བསྟན་ཏོ།
en: The Bhagavat taught them the Dharma of all the ways of happiness.

source: །དེ་ལ་བདེ་བ་སྤྱོད་པའི་ཆོས་ཐམས་ཅད་གང་ཞེ་ན།
en: What are all the ways of happiness?

source: འདི་ལྟ་སྟེ་འཁོར་བའི་འདམ་ལས་བསྒྲལ་བ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གཟུད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཟུད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བྱུང་གི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They are getting across the swamp of saṃsāra, entering the eightfold noble path, and accomplishing omniscience and self-arisen wisdom.

source: །དེ་ལ་བསམ་གཏན་ལ་གཟུད་པའི་སེམས་བསྐྱེད་པ་ཡོངས་སུ་བསྔོ་བ་རྣམ་པ་བཅུ་སྟེ། འདི་ལྟ་སྟེ་ཕན་པའི་དངོས་པོ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཀྱིས་གནས་པ་དང་།
en: In this there are ten aspects of developing the aspiration for entering dhyāna.

source: སེམས་ཅན་མ་རྒལ་བ་རྣམས་བསྒྲལ་བའི་ཕྱིར་གྲུ་ཆེན་པོ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ཡོད་པ་མ་ཡིན་པའི་ཕྱིན་ཅི་ལོག་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་མ་གྲོལ་བ་དགྲོལ་བའི་གོ་ཆ་དང་། ཆོས་ལ་བདག་མེད་པར་སོ་སོར་བརྟག་པའི་ཕྱིར་སེང་གེའི་སྒྲ་ཆེན་པོས་མི་སྐྲག་པའི་གོ་ཆ་དང་། ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། རྨི་ལམ་དང་། མིག་ཡོར་ལྟ་བུར་རྟོགས་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འགྲོ་བའི་གོ་ཆ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ་ལ་གནས་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བས་རྒྱན་པར་བྱེད་པའི་གོ་ཆ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་སྒྲུབ་པའི་གོ་ཆ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པའི་ཕྱིར་མི་འཇིགས་པ་བཞི་ཐོབ་པའི་གོ་ཆ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཇི་ལྟར་ཐོས་པའི་ཆོས་བསྒྲུབ་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་མ་ལུས་པར་ཐོབ་པའི་གོ་ཆ་དང་།
en: They are (1) possessing the aspiration for great compassion for beings; (2) developing that which brings benefit; (3) the acquisition of a great ship to take across those beings who have not crossed over; (4) wearing the armor of liberating those not liberated so as to liberate them from untrue, deluded views; (5) wearing the armor of not being frightened by the lion’s great roar so as to examine the selflessness of all phenomena; (6) wearing the armor of going to all realms so as to understand that all phenomena are like mirages, dreams, and illusions; (7) wearing the armor of adorning the realms with light so as to have an accumulation of good conduct; (8) wearing the armor of accomplishing the ten strengths of a tathāgata in order to complete all the perfections; (9) wearing the armor of attaining the four confidences so as to practice what you have taught; and (10) wearing the armor of attaining all of the eighteen distinct qualities of the Buddha so as to put into practice, without falsehood, the Dharma received by the bodhisattvas.

source: སྤྲོས་པ་མེད་པ་སྟེ། དེ་དག་ནི་བདེ་བ་སྤྱོད་པའི་ཆོས་ཐམས་ཅད་ལ་གཟུད་པ་རྣམ་པ་བཅུའོ། །མཚན་ཉིད་མེད་པའི་སྒོ་ཡོངས་སུ་ཤེས་པ་རྟོགས་པའི་སྤྱོད་པ་དང་།
en: Those are the ten aspects of the practice of entering the Dharma doorways of the way of happiness.

source: ཆོས་ཐམས་ཅད་བདག་མེད་པར་ཡིད་ལ་བྱེད་པ་དང་། སེམས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པར་རྟོགས་པ་གང་ཡིན་པ་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ཡིན་ཏེ། དེ་ལ་ནི་འཇུག་པ་དང་། ལྡོག་པ་ཆད་ཅིང་རྟག་པ་མེད་པ་དང་།
en: There is also the practice of the way of realizing the Dharma doorway of the fearlessnesses: attention to the selflessness of all phenomena and the realization of nonarising and noncessation, the level of irreversibility, which cuts through proceeding and turning back, and has no permanence, no raising up, and no setting down.

source: གདེག་པ་མེད་པ་དང་། གཞག་པ་མེད་པ་ཡིན་ནོ། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁོང་པར་ཞུགས་པའི་སེམས་ཅན་གང་གཱའི་ཀླུང་དུང་ཕྱུར་ཕྲག་བརྒྱད་ཀྱི་བྱེ་མ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: When the Tathāgata gave this Dharma teaching the beings that were inside his body, who were as numerous as the grains of sand in 800 million Ganges Rivers, attained irreversibility from the highest, most complete enlightenment.

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་སྙེད་པོ་དེ་དག་གིས་ནི་གཟུངས་དང་བཟོད་པ་རྣམ་པ་སྣ་ཚོགས་ཐོབ་པར་གྱུར་ནས་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྐུའི་སྤུའི་སྒོ་དག་ནས་ཕྱིར་ཐོན་པ་དང་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: All the countless, innumerable bodhisattva mahāsattvas who were there attained various kinds of retention and acceptance. Then they all came out of the Tathāgata’s pores, were astonished, and bowed down their heads to the Bhagavat’s feet.

source: དེ་བཞིན་གཤེགས་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དང་། སྐུའི་ཚད་བརྟགས་པའི་ཕྱིར་ཕྱོགས་བཅུར་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་དོང་ངོ་།
en: Then they returned to their own buddha realms in the ten directions in order to make known the domain of the Tathāgata’s speech and the extent of his body.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཤར་ཕྱོགས་ལོགས་སུ་དོང་བ་དང་།
en: Countless, innumerable bodhisattvas went to the east.

source: ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་འདས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ནི་ཉམས་པ་མེད་ཅིང་དེར་ཡང་ཚིག་དང་། དོན་དང་། ཡིག་འབྲུ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲ་དག་དེ་བཞིན་དུ་ཐོས་ཏེ།
en: Those in the eastern direction who had not left the buddha realms and had not heard the multitude of praises of the Tathāgata Śākyamuni there listened to the various syllables, words, and meanings of the praises.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔ་ན་འདུག་པའི་ཆོས་ཐོས་པ་དེ་བཞིན་དུ་དེའི་ཆོས་ཐོས་སོ།
en: They heard the Dharma that had been received from the Tathāgata Śākyamuni.

source: །གཞན་ཡང་དེ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཡང་སྐྱེ་བའམ་བྲི་བར་མི་མངོན་ཞིང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་དག་གིས་ཁྱབ་པར་སྣང་སྟེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྤུའི་སྒོ་གཅིག་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་འཇུག་ཅིང་འབྱུང་བར་སྣང་ངོ་། །དེ་བཞིན་དུ་སྤུའི་སྒོ་གཉིས་པ་ནས་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བར་དག་ཏུ་ཡང་འཇུག་ཅིང་འབྱུང་བར་སྣང་སྟེ་ཕྱོགས་བཅུའི་བར་དུ་ཡང་དེ་བཞིན་དུ་བརྗོད་པར་བྱའོ། །ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཇི་སྙེད་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་ཁོང་པར་ཞུགས་པར་གྱུར་པ་དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་སྤུའི་སྒོ་དག་ནས་ཕྱིར་འཐོན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: The bodhisattvas described how it was seen that, without the body of the Tathāgata Śākyamuni becoming greater or smaller, the Tathāgata Śākyamuni’s body became filled with bodhisattvas and śrāvakas; how countless, innumerable bodhisattvas and śrāvakas entered and exited just one of the Tathāgata Śākyamuni’s pores; and how it was the same for a second pore, and so on, up to and including and how it was the same for all his pores.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་དོན་དང་།
en: The same was described in all the ten directions.

source: ཚིག་དང་། ཡི་གེ་དང་། འབྲུ་དང་། སྒྲ་དང་། བརྗོད་པ་སྣ་ཚོགས་དག་གིས་བསྟོད་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་འཁོད་དོ། །དེ་ནས་དེའི་མོད་ལ་འདོད་པ་ན་སྤྱོད་པ་དང་།
en: The entire assembly, who had entered into the body of the Bhagavat and come out through the pores of the Bhagavat’s body, bowed their heads at the Bhagavat’s feet, circumambulated him three times, sat before the Bhagavat, and praised him with the recitation of various sounds, syllables, words, and meanings.

source: གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་སྣ་ཚོགས་ཀྱི་ཆར་དག་རབ་ཏུ་ཕབ་སྟེ། ལྷའི་སིལ་སྙན་དག་ཀྱང་རབ་ཏུ་གསིལ་ནས་ལྷའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: The devas who were inhabitants of the desire realm and the devas who were inhabitants of the form realm sent down a rain of offerings of various incenses, flowers, and perfumes; they also played divine music and offered divine parasols, victory banners, flags, clothing, cloth, and ornaments to the Bhagavat.

source: ན་བཟའ་དང་། རས་བཅོས་བུ་དང་། རྒྱན་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ། །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་ཡང་དག་འདྲེན་ཅེས་བྱ་བ་དེས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ལུང་བསྟན་པ་ཆེན་པོའི་མདོ་སྡེ་འདིའི་མིང་ཅི་ལགས།
en: A bodhisattva named Vaiśāradyasamuddhāraṇi, with palms placed together, bowed to the Bhagavat and asked him, “Bhadanta Bhagavat, what is the name of this sūtra of great prophecy?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པ་ལ་འཇུག་པའི་གཟུངས་ཀྱི་སྒོ་ཞེས་བྱ་བ་དང་།
en: The Bhagavat said, “It is called The Dhāraṇī Entranceway That Is the Form of Omniscience.

source: སངས་རྒྱས་མང་པོ་པ་ཞེས་བྱ་བ་དང་།
en: It is called Numerous Buddhas.

source: མང་པོ་འདུས་པ་ཞེས་བྱ་བ་དང་།
en: It is called The Great Gathering.

source: བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་དང་།
en: It is called The Prophecies to the Bodhisattvas.

source: མི་འཇིགས་པའི་ལམ་དུ་སྒྲོལ་བ་ཞེས་བྱ་བ་དང་།
en: It is called Liberation on the Path of Fearlessness.

source: ཏིང་ངེ་འཛིན་གྱི་རྟོགས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: It is called Entering the Understanding of Samādhi.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་དུ་སྟོན་པ་ཞེས་བྱ་བ་དང་།
en: It is called Revealing All Buddha Realms.

source: རྒྱ་མཚོ་ལྟ་བུ་ཞེས་བྱ་བ་དང་།
en: It is called Like an Ocean.

source: བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བ་དང་།
en: It is called Innumerable.

source: སྙིང་རྗེ་པད་མ་དཀར་པོ་ཞེས་ཀྱང་བྱའོ། །ཡང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ།
en: It is called The White Lotus of Compassion.”
